app/Controllers/ClienteController.php

SELECT *
FROM `clientes`
---
    public function listado() {
        $modelo = new ClienteModel();
        $datos['clientes'] = $modelo->findAll();

SELECT *
FROM `clientes`
WHERE `nombres` LIKE '%A%' ESCAPE '!'
OR  `apellidos` LIKE '%A%' ESCAPE '!'
OR  `cedula` LIKE '%A%' ESCAPE '!'
OR  `telefono` LIKE '%A%' ESCAPE '!'
OR  `email` LIKE '%A%' ESCAPE '!'
---
    public function buscar() {
        $modelo = new ClienteModel();

        // Obtener el término de búsqueda de la URL
        $peticion = $this->request->getVar('busqueda');

        // Realizar la búsqueda en el modelo de Cliente
        $clientes = $modelo->like('nombres', $peticion)
                            ->orLike('apellidos', $peticion)
                            ->orLike('cedula', $peticion)
                            ->orLike('telefono', $peticion)
                            ->orLike('email', $peticion)
                            ->findAll();