app/Controllers/DispositivoController.php

SELECT *
FROM `clientes`
WHERE `cedula` = '1061455600'
 LIMIT 1
---
    public function obtenerNombreClientePorCedula() {
        $cedula = $this->request->getVar('cedula');
        // Lógica para buscar el nombre y el ID del cliente por su cédula en el modelo cliente
        $clienteModel = new ClienteModel();
        $cliente = $clienteModel->where('cedula', $cedula)->first();

INSERT INTO `dispositivos` (`tipoDispositivo`, `marca`, `modelo`, `color`, `serial`, `diagnostico`, `cliente_id`) VALUES ('pantalla', 'hp', '2018', 'negro', 'sd54c', 'con rayas horinzontales', '1')
---
    public function registrarDispositivo()
    {
        // Obtener los datos del dispositivo
        $tipoDispositivo = $this->request->getVar('tipoDispositivo');
        $marca = $this->request->getVar('marca');
        $modelo = $this->request->getVar('modelo');
        $color = $this->request->getVar('color');
        $serial = $this->request->getVar('serial');
        $diagnostico = $this->request->getVar('diagnostico');
        $clienteId = $this->request->getVar('clienteId');

        // Guardar los datos del dispositivo en la base de datos
        $dispositivoModel = new DispositivoModel();
        $data = [
            'tipoDispositivo' => $tipoDispositivo,
            'marca' => $marca,
            'modelo' => $modelo,
            'color' => $color,
            'serial' => $serial,
            'diagnostico' => $diagnostico,
            'cliente_id' => $clienteId
        ];
        $dispositivoModel->insert($data);