app/Controllers/facturaController.php

SELECT *
FROM `dispositivos`
WHERE `dispositivos`.`id` = '5'
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '8'
---
    public function cobrar($orden_id)
    {
        $ordenModel = new OrdenModel;
        $clienteModel = new ClienteModel;
        $dispositivoModel = new DispositivoModel;

        // Obtener detalles de la orden
        $orden = $ordenModel->find($orden_id);

        if (!$orden) {
            return redirect()->back()->with('error', 'La orden no existe o no se encontró');
        }

        // Obtener detalles del ciente asociado al dispositivo
        $dispositivo = $dispositivoModel->find($orden['dispositivo_id']);
        $cliente = $clienteModel->find($dispositivo['cliente_id']);

INSERT INTO `facturas` (`fechaFactura`, `cantidadCobrada`, `orden_id`) VALUES ('2024-04-03 14:37:25', '520000', '12')
---
    public function procesar_cobro() {
        $cantidadCobrada = $this->request->getPost('valorCobrado');
        $ordenId = $this->request->getPost('ordenId');

        // Insertar la nueva factura en la base de datos
        $facturaModel = new FacturaModel();
        $fechaFactura = date('Y-m-d H:i:s');
        $data = [
            'fechaFactura' => $fechaFactura,
            'cantidadCobrada' => $cantidadCobrada,
            'orden_id' => $ordenId
        ];

        $facturaModel->insert($data);